luckyCharm1123/STM32_LED/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body 主程序主体
  * @details        : This file contains the main application code for the STM32 LED
  *                  blinking project with USART2 serial communication.
  *                  本文件包含STM32 LED闪烁和串口通信项目的主应用程序代码。
  *                  USART2 configured on PA2(TX) and PA3(RX) pins at 115200 baud.
  *                  USART2配置在PA2(TX)和PA3(RX)引脚，波特率115200。
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  * @par Project Context 项目背景
  * - MCU: STM32F103xB (ARM Cortex-M3)
  * - IDE: STM32CubeIDE / CMake
  * - Purpose: LED blinking + USART2 serial communication
  * - 目的：LED闪烁 + USART2串口通信
  * - USART2: 115200 8N1, TX=PA2, RX=PA3
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_hal_def.h"
#include <stdio.h>  // 用于printf重定向，实现标准输出到串口
#include <string.h> // 用于字符串操作，如strlen、strncmp、memset等
#include <stdlib.h> // 用于atoi函数，字符串转整数
#include <inttypes.h> // 用于PRIu32等格式化宏
#include "esp.h"    // ESP-01S模块驱动
#include "sht30_soft.h"  // SHT30温湿度传感器驱动（软件I2C版本）
#include "radar.h"  // 毫米波雷达驱动
#include "ir_sensor.h"  // 红外传感器驱动
#include "mqtt_manager.h"  // MQTT发送管理器
#define RX_BUFFER_SIZE 128  // 接收缓冲区大小，最大可接收127个字符+1个结束符
#define TX_BUFFER_SIZE 128  // 发送缓冲区大小，预留128字节
#define ESP_RX_BUFFER_SIZE 512  // ESP接收缓冲区大小（与esp.c中一致）

/* WiFi配置 - 请修改为您的WiFi信息 */
#define WIFI_SSID     "1901"      // WiFi名称
#define WIFI_PASSWORD "qjdq1901"  // WiFi密码

/* MQTT配置 */
#define MQTT_CLIENT_ID "diantiT01"  // MQTT客户端ID
#define MQTT_USERNAME  "test"       // MQTT用户名
#define MQTT_PASSWORD  "supertest"  // MQTT密码

/* MQTT服务器配置 */
#define MQTT_SERVER    "156.233.227.40"  // MQTT服务器地址
#define MQTT_PORT      1588               // MQTT服务器端口
#define MQTT_SSL       0                  // SSL标志 (0=不启用, 1=启用)

UART_HandleTypeDef huart1;  // USART1句柄，用于调试输出（PA9/PA10，115200）
UART_HandleTypeDef huart2;  // USART2句柄，用于管理串口2的所有操作
UART_HandleTypeDef huart3;  // USART3句柄，用于毫米波雷达通信（PB10/PB11，115200）
DMA_HandleTypeDef hdma_usart3_rx;  // USART3接收DMA句柄

/* USER CODE BEGIN PV */
/* 用户代码开始：私有变量 */

/* 串口接收缓冲区（用于中断接收） */
uint8_t rx_buffer[1];  // 单字节接收缓冲区

/* ESP相关外部变量声明（在esp.c中定义） */
extern char RxData[512];  // ESP接收缓冲区（从STM32-ESP01S移植）
extern uint16_t DataPointer;  // ESP接收数据指针
extern uint8_t CompeteRx;  // ESP接收完成标志

/* ESP接收缓冲区（主循环使用） */
extern uint8_t esp_rx_complete;     // ESP接收完成标志
extern char esp_rx_buffer[];        // ESP接收缓冲区
extern uint16_t esp_rx_index;       // ESP接收索引
extern uint8_t esp_response_ready;  // ESP响应就绪标志
extern uint32_t esp_last_rx_time;   // ESP最后接收时间

/* 动态WiFi配置变量 */
char current_wifi_ssid[64] = WIFI_SSID;        // 当前WiFi SSID
char current_wifi_password[64] = WIFI_PASSWORD; // 当前WiFi密码
char old_wifi_ssid[64];                         // 旧WiFi SSID（用于回滚）
char old_wifi_password[64];                     // 旧WiFi密码（用于回滚）
uint8_t wifi_config_updated = 0;                // WiFi配置更新标志

/* 设备码 - 基于芯片唯一ID生成 */
char g_device_code[9];  // 全局设备码，8位十六进制 + 结束符
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);  // 系统时钟配置函数声明
static void MX_GPIO_Init(void); // GPIO初始化函数声明（静态函数，仅在本文件内可见）
static void MX_USART1_UART_Init(void); // USART1初始化函数声明（调试串口）
static void MX_USART2_UART_Init(void); // USART2初始化函数声明
static void MX_USART3_UART_Init(void); // USART3初始化函数声明（雷达串口）

/* USER CODE BEGIN PFP */
/* 用户代码开始：私有函数原型 */
void DEBUG_SendString(const char *str);    // USART1调试串口发送函数原型
void Get_STM32_UID(char *uid_str);         // 获取STM32芯片唯一ID
void Generate_Device_Code(char *device_code);  // 生成8位设备码
uint8_t Process_Sensor_Status(uint8_t *last_combined_state);  // 处理传感器状态并返回综合状态
/**
  * @brief USART1发送调试信息
  * @param str: 要发送的调试字符串，以'\0'结尾
  * @retval None
  * @details USART1专用调试串口，配置在PA9(TX)/PA10(RX)
  *          波特率115200，用于输出系统调试信息
  */
void DEBUG_SendString(const char *str)
{
  HAL_UART_Transmit(&huart1, (uint8_t*)str, strlen(str), HAL_MAX_DELAY);
}

int main(void)
{
  HAL_Init();
  SystemClock_Config();
  MX_GPIO_Init();              // 初始化GPIO
  MX_USART1_UART_Init();       // 初始化USART1（调试串口）
  MX_USART2_UART_Init();       // 初始化USART2（ESP通信串口）
  MX_USART3_UART_Init();       // 初始化USART3（雷达串口）
  SHT30_Soft_Init();  // 初始化软件I2C
  HAL_Delay(10);
  /* 初始化雷达模块 */
  if(RADAR_Init() != 0)
  {
    DEBUG_SendString("[ERR] Radar init failed\r\n");
  }
  /* 初始化红外传感器模块 */
  if(IR_SENSOR_Init() != 0)
  {
    DEBUG_SendString("[ERR] IR Sensor init failed\r\n");
  }
  /* 启动串口接收中断，用于接收ESP模块的响应 */
  HAL_UART_Receive_IT(&huart2, &rx_buffer[0], 1);
  /* 生成设备码（基于芯片唯一ID） */
  Generate_Device_Code(g_device_code);
  char device_msg[64];
  /* 拼接字符串 */
  snprintf(device_msg, sizeof(device_msg), "Device Code: %s\r\n", g_device_code);
  /* 发送到串口调试 */
  DEBUG_SendString(device_msg);

  /* ESP初始化 - 使用从STM32-ESP01S移植的简化驱动 */
  DEBUG_SendString("\r\n=== ESP01S Initialization ===\r\n");

  char msg[128];
  snprintf(msg, sizeof(msg), "WiFi: %s\r\n", current_wifi_ssid);
  DEBUG_SendString(msg);
  snprintf(msg, sizeof(msg), "MQTT: %s:%d\r\n", MQTT_SERVER, MQTT_PORT);
  DEBUG_SendString(msg);
  snprintf(msg, sizeof(msg), "Client ID: %s\r\n", g_device_code);
  DEBUG_SendString(msg);
  /* 初始化ESP模块并连接WiFi和MQTT */
  /* 使用设备码(g_device_code)作为MQTT客户端ID，确保每台设备唯一 */
  ESP01S_Init(current_wifi_ssid, current_wifi_password,
                 g_device_code, MQTT_USERNAME, MQTT_PASSWORD,
                 MQTT_SERVER, MQTT_PORT);
  DEBUG_SendString("=== WiFi and MQTT Initialized ===\r\n");
  
  /* 订阅MQTT主题 - 接收服务器下发的消息 */
  DEBUG_SendString("\r\n=== MQTT Subscription ===\r\n");
  if(ESP_SubscribeMQTT(MQTT_SUBSCRIBE_TOPIC) == ESP_OK)
  {
    char sub_msg[128];
    snprintf(sub_msg, sizeof(sub_msg), "[OK] Subscribed to topic: %s\r\n\r\n", MQTT_SUBSCRIBE_TOPIC);
    DEBUG_SendString(sub_msg);
  }
  else
  {
    DEBUG_SendString("[WARN] MQTT subscription failed\r\n");
  }
  MQTT_Manager_Init();  
  DEBUG_SendString("[MQTT] Initialization Successful\r\n");
  DEBUG_SendString("[SYSTEM] Initialization Successful\r\n\r\n");


  /* 传感器状态输出计时变量 */
  static uint32_t last_sensor_output_time = 0;
  const uint32_t sensor_output_interval = 500;  // 500ms输出一次

  /* 综合状态变量 */
  static uint8_t last_combined_has_person = 0;  // 上次综合状态（0=无人，1=有人）

  /* MQTT发送计时变量 */
  static uint32_t last_send_time = 0;  // 上次发送时间

