luckyCharm1123/STM32_LED/Core/Src/main.c
  /* MQTT重连变量 */
  static uint8_t need_reconnect = 0;   // 需要重连标志

  while (1)
  {
    /* 检查是否需要重连（失败次数超过阈值） */
    if(MQTT_Manager_ShouldReconnect() && !need_reconnect)
    {
      need_reconnect = 1;
      DEBUG_SendString("\r\n[MQTT] Connection lost! Reconnecting...\r\n");
    }

    /* 执行重连操作 */
    if(need_reconnect)
    {
      DEBUG_SendString("=== Reconnecting ESP and MQTT ===\r\n");

      /* 重新初始化ESP模块并连接WiFi和MQTT */
      ESP01S_Init(current_wifi_ssid, current_wifi_password,
                     g_device_code, MQTT_USERNAME, MQTT_PASSWORD,
                     MQTT_SERVER, MQTT_PORT);
      DEBUG_SendString("=== WiFi and MQTT Reconnected ===\r\n");

      /* 重新订阅MQTT主题 */
      DEBUG_SendString("\r\n=== MQTT Subscription ===\r\n");
      if(ESP_SubscribeMQTT(MQTT_SUBSCRIBE_TOPIC) == ESP_OK)
      {
        char sub_msg[128];
        snprintf(sub_msg, sizeof(sub_msg), "[OK] Subscribed to topic: %s\r\n\r\n", MQTT_SUBSCRIBE_TOPIC);
        DEBUG_SendString(sub_msg);
      }
      else
      {
        DEBUG_SendString("[WARN] MQTT subscription failed\r\n");
      }

      /* 重置MQTT管理器 */
      MQTT_Manager_Init();
      DEBUG_SendString("[MQTT] Manager Reset Successful\r\n");
      DEBUG_SendString("[SYSTEM] Reconnection Successful\r\n\r\n");

      /* 清除重连标志 */
      need_reconnect = 0;
    }
    /* 处理雷达数据 */
    RADAR_Process();

    /* 处理红外传感器数据 */
    IR_SENSOR_Process();

    /* 每500ms处理并输出一次传感器状态 */
    if(HAL_GetTick() - last_sensor_output_time >= sensor_output_interval)
    {
      Process_Sensor_Status(&last_combined_has_person);
      last_sensor_output_time = HAL_GetTick();
    }

    /* 处理MQTT消息发送 */
    if(MQTT_Manager_ShouldSend(last_send_time))
    {
      /* 准备传感器数据 */
      MQTT_SensorData_t sensor_data;

      /* 获取雷达数据 */
      Radar_TargetInfo_t radar_info;
      uint8_t radar_has_person = 0;  /* 雷达是否检测到有人 */
      if(RADAR_GetTargetInfo(&radar_info) == 0)
      {
        sensor_data.motion_detected = (radar_info.status == RADAR_TARGET_WITH_INFO) ? 1 : 0;

        /* 判断雷达状态：DETECTED、WITH_INFO、BUFFERING 都算有人 */
        if(radar_info.status == RADAR_TARGET_DETECTED ||
           radar_info.status == RADAR_TARGET_WITH_INFO ||
           radar_info.status == RADAR_TARGET_BUFFERING)
        {
          radar_has_person = 1;
          /* 有人时，设置距离和信号强度 */
          sensor_data.radar_raw = radar_info.range_cm;      /* R: 距离 */
          sensor_data.human_presence = radar_info.power;     /* P: 信号强度 */
        }
        else
        {
          /* 无人时，距离和信号强度都为0 */
          sensor_data.radar_raw = 0;
          sensor_data.human_presence = 0;
        }
      }
      else
      {
        sensor_data.radar_raw = 0;
        sensor_data.human_presence = 0;
        sensor_data.motion_detected = 0;
      }

      /* 获取红外传感器数据 */
      IRSensorData_t ir_data;
      if(IR_SENSOR_GetData(&ir_data) == 0)
      {
        sensor_data.ir_status = (ir_data.state == IR_STATE_PRESENCE) ? 1 : 0;
      }
      else
      {
        sensor_data.ir_status = 0;
      }

      /* 综合状态：雷达或红外任一检测到有人即为有人 (与Process_Sensor_Status中的逻辑一致) */
      sensor_data.static_value = (radar_has_person || sensor_data.ir_status) ? 1 : 0;  /* s: 综合状态 */

      /* 根据当前模式选择发送方式 */
      if(MQTT_Manager_GetMode() == MQTT_SEND_MODE_RAPID)
      {
        /* ========== 快速发送模式：不采集温湿度数据 ========== */
        sensor_data.temperature = 0.0f;
        sensor_data.humidity = 0.0f;

        /* 快速发送 */
        MQTT_Manager_SendSensorDataRapid(&sensor_data);
      }
      else
      {
        /* ========== 普通发送模式：采集所有传感器数据 ========== */

        /* 获取温湿度数据 */
        float temperature, humidity;
        if(SHT30_Soft_Read(&temperature, &humidity) == 0)
        {
          sensor_data.temperature = temperature;
          sensor_data.humidity = humidity;
        }
        else
        {
          /* 读数失败，使用默认值 */
          sensor_data.temperature = 0.0f;
          sensor_data.humidity = 0.0f;
        }

        /* 普通发送 */
        MQTT_Manager_SendSensorDataNormal(&sensor_data);
      }

      /* 更新发送时间 */
      last_send_time = HAL_GetTick();
    }

    /* 短暂延时，避免CPU空转 */
    HAL_Delay(10);
  }
}

/**
  * @brief System Clock Configuration 系统时钟配置
  * @details 配置STM32的系统时钟源和各总线时钟分频
  *          本配置使用内部高速时钟(HSI)作为系统时钟源
  *          HSI = 8MHz (内部RC振荡器)
  * @retval None 无返回值
  * @note 时钟树配置：
  *       HSI(8MHz) → SYSCLK(8MHz) → HCLK(8MHz)
  *       → PCLK1(8MHz) → APB1外设（包括USART2）
  *       → PCLK2(8MHz) → APB2外设
  * @note 时钟配置说明：
  *       - 不使用PLL，直接使用HSI作为系统时钟
  *       - 所有总线时钟都为8MHz
  *       - Flash等待周期为0（8MHz以下不需要等待）
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};  // 振荡器初始化结构体
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};  // 时钟初始化结构体

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  * 根据RCC_OscInitTypeDef结构体中的指定参数初始化RCC振荡器
  * 
  * 配置振荡器参数：
  * - 选择振荡器类型：内部高速时钟(HSI)
  * - 设置工作状态：开启
  * - 校准值：使用默认校准值
  * - PLL状态：不使用（关闭）
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;  // 振荡器类型：内部高速时钟(HSI)
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;                    // HSI状态：开启
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;  // HSI校准值：默认值
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;              // PLL状态：不使用（PLL关闭）
  
  /* 应用振荡器配置 */
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();  // 如果配置失败，调用错误处理函数
  }

  /** Initializes the CPU, AHB and APB buses clocks
  * 初始化CPU、AHB和APB总线时钟
  * 
  * 配置时钟树参数：
  * - 选择系统时钟源：HSI
  * - 设置各总线分频系数：都不分频
  * - 配置Flash等待周期：0（8MHz以下不需要等待）
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;  // 时钟类型：HCLK、SYSCLK、PCLK1、PCLK2
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;    // 系统时钟源：HSI
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;        // AHB时钟分频：不分频（HCLK = SYSCLK）
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;         // APB1时钟分频：不分频（PCLK1 = HCLK）
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;         // APB2时钟分频：不分频（PCLK2 = HCLK）

