luckyCharm1123/STM32_LED/Core/Src/main.c
  /* 获取并输出雷达目标状态 */
  Radar_TargetStatus_t target_status = RADAR_GetTargetStatus();
  char radar_msg[128];

  const char* status_str;
  switch(target_status)
  {
    case RADAR_TARGET_NOBODY:
      status_str = "NOBODY";
      break;
    case RADAR_TARGET_DETECTED:
      status_str = "DETECTED";
      break;
    case RADAR_TARGET_WITH_INFO:
      status_str = "WITH_INFO";
      break;
    case RADAR_TARGET_BUFFERING:
      status_str = "BUFFERING";
      break;
    default:
      status_str = "UNKNOWN";
      break;
  }

  snprintf(radar_msg, sizeof(radar_msg), "[RADAR] Target Status: %s\r\n", status_str);

  /* 获取并处理红外传感器状态 */
  IRSensorData_t ir_data;
  if(IR_SENSOR_GetData(&ir_data) == 0)
  {
    /* 状态机维护逻辑 */
    if(ir_data.pin_level == 1)
    {
      /* 当前读到高电平（有人） */
      ir_high_count++;
      ir_low_count = 0;

      /* 连续5次高电平，切换到有人状态 */
      if(ir_high_count >= IR_THRESHOLD)
      {
        ir_stable_state = IR_STATE_PRESENCE;
      }
    }
    else
    {
      /* 当前读到低电平（无人） */
      ir_low_count++;
      ir_high_count = 0;

      /* 连续5次低电平，切换到无人状态 */
      if(ir_low_count >= IR_THRESHOLD)
      {
        ir_stable_state = IR_STATE_NOBODY;
      }
    }

    /* 输出稳定状态和当前引脚电平 */
    char ir_msg[128];
    const char* ir_state_str = (ir_stable_state == IR_STATE_PRESENCE) ? "PRESENCE" : "NOBODY";
    snprintf(ir_msg, sizeof(ir_msg), "[IR] State: %s, Pin: %d\r\n",
             ir_state_str, ir_data.pin_level);
  }

  /* 综合判断：两个传感器只要有一个显示有人，综合状态就为有人 */
  uint8_t radar_has_person = 0;
  uint8_t ir_has_person = 0;

  /* 判断雷达状态：DETECTED、WITH_INFO、BUFFERING 都算有人 */
  if(target_status == RADAR_TARGET_DETECTED ||
     target_status == RADAR_TARGET_WITH_INFO ||
     target_status == RADAR_TARGET_BUFFERING)
  {
    radar_has_person = 1;
  }

  /* 判断红外状态：PRESENCE 算有人 */
  if(ir_stable_state == IR_STATE_PRESENCE)
  {
    ir_has_person = 1;
  }

  /* 综合状态：只要有一个传感器检测到有人，综合状态就是有人 */
  uint8_t combined_has_person = (radar_has_person || ir_has_person) ? 1 : 0;
  const char* combined_state_str = combined_has_person ? "PRESENCE" : "NOBODY";
  char combined_msg[128];
  snprintf(combined_msg, sizeof(combined_msg), "[COMBINED] State: %s\r\n", combined_state_str);
  DEBUG_SendString(combined_msg);

  /* 检测综合状态从无人切换到有人 */
  if(combined_has_person == 1 && *last_combined_state == 0)
  {
    /* 状态从无人切换到有人，激活MQTT快速发送模式 */
    MQTT_Manager_SetMode(MQTT_SEND_MODE_RAPID);

    /* 如果当前已经是快速发送模式，清空快速发送次数计数器 */
    if(MQTT_Manager_GetMode() == MQTT_SEND_MODE_RAPID)
    {
      MQTT_Manager_ResetRapidCounter();
    }

    DEBUG_SendString("[MQTT] Activated rapid send mode\r\n");
  }

  /* 更新上次的综合状态 */
  *last_combined_state = combined_has_person;

  return combined_has_person;
}

/**
  * @brief 生成8位设备码
  * @param device_code: 存储8位设备码的缓冲区（至少9字节，包含结束符）
  * @retval None
  * @details 基于STM32唯一ID生成8位十六进制设备码
  *          取UID的前32位，转换为8位十六进制字符串
  *          这样每台设备都有唯一的设备标识
  */
void Generate_Device_Code(char *device_code)
{
  // STM32F103唯一ID地址：0x1FFFF7E8
  const uint32_t *uid_base = (const uint32_t *)0x1FFFF7E8U;

  // 读取第一个32位ID
  uint32_t uid_0 = uid_base[0];

  // 格式化为8位十六进制字符串
  sprintf(device_code, "%08" PRIX32, uid_0);
}

/**
  * @brief USART2中断回调函数
  * @param huart: UART句柄
  * @retval None
  * @details 当接收到一个字节数据时调用此函数
  *          这是HAL库的中断回调函数，需要在stm32f1xx_it.c中配置USART2_IRQHandler
  *          该中断服务函数会调用HAL_UART_IRQHandler，最终调用此回调函数
  * @note 接收流程：
  *       1. HAL_UART_Receive_IT启动接收
  *       2. 接收到数据后触发USART2_IRQHandler
  *       3. HAL_UART_IRQHandler处理中断并调用此回调函数
  *       4. 在回调函数中处理数据并准备下一次接收
  */
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
  // 检查是否是USART2的中断
  if(huart->Instance == USART2)
  {
      // 更新最后接收时间戳（用于超时检测）
      esp_last_rx_time = HAL_GetTick();

      // 检查是否收到换行符或回车符，表示ESP模块的一行响应结束
      if(rx_buffer[0] == '\r' || rx_buffer[0] == '\n')
      {
        // 确保缓冲区中有数据（不是连续的换行符）
        if(esp_rx_index > 0)
        {
          // 添加字符串结束符，使ESP驱动层能正确解析响应
          esp_rx_buffer[esp_rx_index] = '\0';
          // 设置ESP接收完成标志
          esp_rx_complete = 1;
          // 设置响应就绪标志，让等待函数能够立即处理
          esp_response_ready = 1;

          // 注意：不在中断中重置esp_rx_index
          // 索引将在主循环处理完响应后被ESP_SendATCommand重置
        }
        // 如果esp_rx_index==0，说明是连续的换行符，直接忽略，不存储
      }
      else
      {
        // 不是换行符，存储到缓冲区
        if(esp_rx_index < ESP_RX_BUFFER_SIZE - 1)
        {
          esp_rx_buffer[esp_rx_index] = rx_buffer[0];
          esp_rx_index++;
        }
        else
        {
          // 缓冲区满，强制标记为完成并重置
          // 这样可以避免缓冲区溢出导致的数据丢失
          esp_rx_buffer[esp_rx_index] = '\0';
          esp_rx_complete = 1;
          esp_response_ready = 1;
          // 注意：索引将在主循环中被重置
        }
      }

      // 继续接收下一个字节（ESP模式）
      HAL_UART_Receive_IT(&huart2, &rx_buffer[0], 1);
  }
  // 注意：USART3使用HAL_UARTEx_RxEventCallback，不在这里处理
}

/**
  * @brief UART接收事件回调函数 (用于雷达DMA+空闲中断)
  * @param huart: UART句柄
  * @param Size: 当前DMA缓冲区中的数据量
  * @retval None
  * @details 当DMA接收完成或检测到空闲帧时调用此函数
  *          用于USART3的雷达数据接收
  */
void HAL_UARTEx_RxEventCallback(UART_HandleTypeDef *huart, uint16_t Size)
{
  // 检查是否是USART3的中断（雷达数据）
  if(huart->Instance == USART3)
  {
      // 调用雷达驱动的UART事件回调函数
      RADAR_UART_RxEventCallback(huart, Size);
  }
}

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence. 此函数在发生错误时执行
  * @details 当程序遇到严重错误时调用此函数
  *          典型错误场景：
  *          - 时钟配置失败
  *          - 外设初始化失败
  *          - 硬件故障
  *          - 软件异常
  * @retval None 无返回值
  * @note 此函数不会返回，程序在此处阻塞
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* 用户代码开始：错误处理调试 */

  /* 标准错误处理实现 */
  __disable_irq();  // 禁用所有中断
  /*
   * __disable_irq()说明：
   * - 关闭全局中断使能
   * - 防止在错误状态下执行中断服务程序
   * - 提高系统安全性
   */

  /* 错误状态指示：死循环 */
  while (1)
  {
    /* 程序在此处阻塞，可以通过调试器查看错误原因 */
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  *         报告发生assert_param错误的源文件名和源行号
  * @details 这是断言失败时的回调函数
  *          用于调试和开发阶段检测参数错误
  *          当HAL库中的assert_param宏检测到无效参数时调用此函数
  * @param  file: pointer to the source file name 源文件名指针
  * @param  line: assert_param error line source number 断言参数错误的行号
  * @retval None 无返回值
  * @note 此函数仅在调试版本中有效（定义了USE_FULL_ASSERT宏）
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* 用户代码开始：第6区 */
  /* 可以在此处添加断言失败的处理代码 */
  /* 典型实现：
   * printf("Assert failed: %s, line %lu\n", file, line);
   * 或者通过串口发送错误信息
   * 或者在调试器中设置断点
   */
  
  /* 无限循环，便于调试时定位问题 */
  while (1)
  {
  }
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
